{"content": "<p>Il est plus fréquent qu&rsquo;on ne le croit de trouver des images avec un attribut <strong>src</strong> vide. Ceci apparaît sous deux formes :</p><ol><li>En HTML</li></ol><pre><code>&lt;img src=&quot;&quot;&gt;</code></pre><ol><li>En JavaScript</li></ol><pre><code>var img = new Image();img.src = &quot;&quot;;</code></pre><p>Les deux formes ont le même effet : le navigateur fait une nouvelle demande à votre serveur.</p><ul><li><strong>Internet Explorer</strong> fait une demande pour le répertoire dans lequel se trouve la page.</li><li><strong>Safari et Chrome</strong> font la demande à la page elle-même.</li><li><strong>Firefox</strong> 3 et les versions antérieures se comportent comme Safari et Chrome, mais la version 3.5 a abordé cette question dans le rapport de <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=444931\">[bug 444931]</a> et n&rsquo;envoie donc plus de nouvelle demande.</li><li><strong>Opéra</strong> ne fait rien.</li></ul><p><strong>Pourquoi est-ce un mauvais comportement ?</strong></p><ol><li>Paralyse vos serveurs en envoyant une grande quantité de trafic inattendu, surtout pour les pages qui obtiennent des millions de pages vues par jour.</li><li>Perte de puissance de calcul pour générer une page qui ne sera jamais vue.</li><li>Données de l&rsquo;utilisateur éventuellement corrompues. Si vous suivez l&rsquo;état de la requête, que ce soit par cookies ou d&rsquo;une autre manière, vous avez la possibilité de détruire les données. Même si la demande d&rsquo;image ne ​​renvoie pas d&rsquo;image, tous les en-têtes sont lus et acceptés par le navigateur, y compris tous les cookies. Alors que le reste de la réponse est rejetée, des dégâts peuvent déjà être faits.</li></ol><p>La cause de ce comportement est la façon dont la résolution URI est effectuée dans les navigateurs. Ce comportement est défini dans la RFC 3986 - Uniform Resource Identifiers. Quand une chaîne vide est rencontrée comme URI, celle-ci est considérée comme un URI relatif et est résolu selon l&rsquo;algorithme défini dans la section 5.2. Ce cas particulier est détaillé à la section 5.4. Firefox, Safari et Chrome ont tous résolu ce problème de chaîne vide correctement dans leur cahier des charges, alors qu&rsquo;Internet Explorer le résout de façon incorrecte, apparemment selon une version antérieure de la spécification, RFC 2396 - Uniform Resource Identifiers (rendue obsolète par la RFC 3986). Ainsi, techniquement, les navigateurs font ce qu&rsquo;ils sont censés faire pour résoudre les URI relatifs. Le problème est que dans ce contexte, la chaîne vide est clairement involontaire.</p><p>À la section 4.8.2, HTML5 ajoute à la description de l&rsquo;attribut src de la balise l&rsquo;indication aux navigateurs de ne pas faire une demande supplémentaire :</p><blockquote><p>L&rsquo;attribut src doit être présent et doit contenir une URL valide de référencement d&rsquo;une image, éventuellement animée mais non-interactive, ni paginée ou scriptée. Si l&rsquo;URI de base de l&rsquo;élément est la même que l&rsquo;adresse du document, alors la valeur de l&rsquo;attribut src ne peut pas être une chaîne vide.</p></blockquote><p>Heureusement, les navigateurs n&rsquo;auront plus ce problème à l&rsquo;avenir. Malheureusement, il n&rsquo;existe pas de telle clause pour <code>&lt;script src=&quot;&quot;&gt;</code> et <code>&lt;link href=&quot;&quot;&gt;</code>. Peut-être qu&rsquo;il est encore temps de faire cet ajustement pour s&rsquo;assurer que les navigateurs n&rsquo;implémentent ce comportement par accident.</p><p>Cette règle a été inspirée par le gourou JavaScript Yahoo! Nicolas C. Zakas. Pour plus d&rsquo;informations, consultez son article &ldquo;<a href=\"http://www.nczonline.net/blog/2009/11/30/empty-image-src-can-destroy-your-site/\">Empty image src can destroy your site</a>&rdquo;.</p>", "id": "yemptysrc", "title": "Éviter les balises image src vides"}