{"content": "<p>The Domain Name System (DNS) maps hostnames to IP addresses, just as phonebooks map people&rsquo;s names to their phone numbers. When you type www.yahoo.com into your browser, a DNS resolver contacted by the browser returns that server&rsquo;s IP address. DNS has a cost. It typically takes 20-120 milliseconds for DNS to lookup the IP address for a given hostname. The browser can&rsquo;t download anything from this hostname until the DNS lookup is completed.</p><p>DNS lookups are cached for better performance. This caching can occur on a special caching server, maintained by the user&rsquo;s ISP or local area network, but there is also caching that occurs on the individual user&rsquo;s computer. The DNS information remains in the operating system&rsquo;s DNS cache (the &ldquo;DNS Client service&rdquo; on Microsoft Windows). Most browsers have their own caches, separate from the operating system&rsquo;s cache. As long as the browser keeps a DNS record in its own cache, it doesn&rsquo;t bother the operating system with a request for the record.</p><p>Internet Explorer caches DNS lookups for 30 minutes by default, as specified by the <code>DnsCacheTimeout</code> registry setting. Firefox caches DNS lookups for 1 minute, controlled by the <code>network.dnsCacheExpiration</code> configuration setting. (Fasterfox changes this to 1 hour.)</p><p>When the client&rsquo;s DNS cache is empty (for both the browser and the operating system), the number of DNS lookups is equal to the number of unique hostnames in the web page. This includes the hostnames used in the page&rsquo;s URL, images, script files, stylesheets, Flash objects, etc. Reducing the number of unique hostnames reduces the number of DNS lookups.</p><p>Reducing the number of unique hostnames has the potential to reduce the amount of parallel downloading that takes place in the page. Avoiding DNS lookups cuts response times, but reducing parallel downloads may increase response times. My guideline is to split these components across at least two but no more than four hostnames. This results in a good compromise between reducing DNS lookups and allowing a high degree of parallel downloads.</p>", "tags": ["content"], "id": "ydns", "title": "Reduce DNS lookups"}