{"content": "<p>Image with empty string <strong>src</strong> attribute occurs more than one will expect. It appears in two form:</p><ol><li>straight HTML</li></ol><pre><code>&lt;img src=&quot;&quot;&gt;</code></pre><ol><li>JavaScript</li></ol><pre><code>var img = new Image();img.src = &quot;&quot;;</code></pre><p>Both forms cause the same effect: browser makes another request to your server.</p><ul><li><strong>Internet Explorer</strong> makes a request to the directory in which the page is located.</li><li><strong>Safari and Chrome</strong> make a request to the actual page itself.</li><li><strong>Firefox</strong> 3 and earlier versions behave the same as Safari and Chrome, but version 3.5 addressed this issue <a href=\"https://bugzilla.mozilla.org/show_bug.cgi?id=444931\">[bug 444931]</a> and no longer sends a request.</li><li><strong>Opera</strong> does not do anything when an empty image src is encountered.</li></ul><p><strong>Why is this behavior bad?</strong></p><ol><li>Cripple your servers by sending a large amount of unexpected traffic, especially for pages that get millions of page views per day.</li><li>Waste server computing cycles generating a page that will never be viewed.</li><li>Possibly corrupt user data. If you are tracking state in the request, either by cookies or in another way, you have the possibility of destroying data. Even though the image request does not return an image, all of the headers are read and accepted by the browser, including all cookies. While the rest of the response is thrown away, the damage may already be done.</li></ol><p>The root cause of this behavior is the way that URI resolution is performed in browsers. This behavior is defined in RFC 3986 - Uniform Resource Identifiers. When an empty string is encountered as a URI, it is considered a relative URI and is resolved according to the algorithm defined in section 5.2. This specific example, an empty string, is listed in section 5.4. Firefox, Safari, and Chrome are all resolving an empty string correctly per the specification, while Internet Explorer is resolving it incorrectly, apparently in line with an earlier version of the specification, RFC 2396 - Uniform Resource Identifiers (this was obsoleted by RFC 3986). So technically, the browsers are doing what they are supposed to do to resolve relative URIs. The problem is that in this context, the empty string is clearly unintentional.</p><p>HTML5 adds to the description of the tag&rsquo;s src attribute to instruct browsers not to make an additional request in section 4.8.2:</p><blockquote><p>The src attribute must be present, and must contain a valid URL referencing a non-interactive, optionally animated, image resource that is neither paged nor scripted. If the base URI of the element is the same as the document&rsquo;s address, then the src attribute&rsquo;s value must not be the empty string.</p></blockquote><p>Hopefully, browsers will not have this problem in the future. Unfortunately, there is no such clause for <code>&lt;script src=&quot;&quot;&gt;</code> and <code>&lt;link href=&quot;&quot;&gt;</code>. Maybe there is still time to make that adjustment to ensure browsers don&rsquo;t accidentally implement this behavior.</p><p>This rule was inspired by Yahoo!&rsquo;s JavaScript guru Nicolas C. Zakas. For more information check out his article &ldquo;<a href=\"http://www.nczonline.net/blog/2009/11/30/empty-image-src-can-destroy-your-site/\">Empty image src can destroy your site</a>&rdquo;.</p>", "tags": ["server"], "id": "yemptysrc", "title": "Avoid Empty Image src"}