{"content": "<p>Inclure le même fichier JavaScript à deux reprises dans une seule page nuit à la performance. Ce n&rsquo;est pas aussi rare qu&rsquo;on pourrait le penser. Un examen des dix meilleurs sites web américains montre que deux d&rsquo;entre eux contiennent un script dupliqué. Deux principaux facteurs augmentent les chances d&rsquo;un script d&rsquo;être dupliqué dans une page Web : la taille de l&rsquo;équipe et le nombre de scripts. Lorsque cela arrive, le doublon met à mal les performances en créant des requêtes HTTP inutiles et l&rsquo;exécution de code JavaScript perdu.</p><p>Des requêtes HTTP inutiles se produisent dans Internet Explorer mais pas dans Firefox. Dans Internet Explorer, si un script externe est inclus deux fois et n&rsquo;est pas mis en cache, il génère deux requêtes HTTP lors du chargement de la page. Même si le script est mis en cache, des requêtes HTTP supplémentaires se produisent lorsque l&rsquo;utilisateur recharge la page.</p><p>En plus de générer des requêtes HTTP inutiles, du temps est perdu à interpréter le script plusieurs fois. Cette exécution JavaScript redondante se passe dans Firefox et Internet Explorer, indépendamment du fait que le script est mis en cache.</p><p>Une façon d&rsquo;éviter d&rsquo;inclure accidentellement le même script deux fois est de mettre en place un module de gestion de scripts dans votre système de templates. La manière typique d&rsquo;inclure un script est d&rsquo;utiliser la balise SCRIPT dans votre page HTML.</p><pre><code>&lt;script type=&quot;text/javascript&quot; src=&quot;menu_1.0.17.js&quot;&gt;&lt;/script&gt;</code></pre><p>Une alternative en PHP serait de créer une fonction appelée <code>insertScript</code>.</p><pre><code>&lt;?php insertScript(&quot;menu.js&quot;) ?&gt;</code></pre><p>En plus de prévenir le même script d&rsquo;être inséré à plusieurs reprises, cette fonction pourrait traiter d&rsquo;autres choses avec des scripts, tels que le contrôle des dépendances et l&rsquo;ajout de numéros de version pour les noms de fichiers de scripts. Ceci afin de bénéficer des en-têtes Expire.</p>", "id": "ydupes", "title": "Supprimer les scripts en doublons"}