{"content": "<p>le préchargement peut sembler de prime abord l&rsquo;exact opposé du post-chargement, mais il a en fait un objectif différent. Le préchargement de composants consiste à profiter du temps où le navigateur est inactif pour charger des composants de la demande dont vous aurez besoin plus tard (comme les images, les styles et les scripts). De cette façon, lorsque l&rsquo;internaute visite la page suivante, vous pourriez avoir la plupart des composants déjà dans le cache et votre page se chargera beaucoup plus rapidement pour l&rsquo;utilisateur.</p><p>Il y a en fait plusieurs types de préchargements :</p><ul><li>Préchargement <em>inconditionnel</em> - dès que l&rsquo;événement onload se produit, allez-y et récupérez quelques composants supplémentaires. Vérifiez google.com pour voir un exemple de la façon dont une image composée de sprites est demandé onload. Cette image composée de sprites n&rsquo;est pas nécessaire sur la page d&rsquo;accueil de google.com, mais elle est nécessaire sur la page de résultat de recherche consécutive.</li><li>Préchargement <em>conditionnel</em> - basé sur une action de l&rsquo;utilisateur à faire une supposition éclairée de la prochaine étape de l&rsquo;utilisateur et précharger en conséquence. Sur <a href=\"http://search.yahoo.com\">search.yahoo.com</a> vous pouvez voir comment certains composants supplémentaires sont demandés après que vous ayez commencé à taper dans la zone de saisie.</li><li>Préchargement <em>prévu</em> - précharge à l&rsquo;avance avant de lancer une refonte du design d&rsquo;un site. Il arrive souvent après une refonte que vous entendiez : «Le nouveau site est cool, mais il est plus lent qu&rsquo;avant». Une partie du problème pourrait être que les utilisateurs étaient en visite sur votre ancien site avec un cache complet, mais le nouveau est toujours parcouru avec un cache vide. Vous pouvez atténuer cet effet secondaire par le préchargement des composants avant même de lancer la refonte. Votre ancien site utilise le temps pendant lequel le navigateur est inactif pour demander des images et des scripts qui seront utilisés par le nouveau site.</li></ul>", "id": "ypreload", "title": "Précharger les composants"}