{"content": "<p>The user&rsquo;s proximity to your web server has an impact on response times. Deploying your content across multiple, geographically dispersed servers will make your pages load faster from the user&rsquo;s perspective. But where should you start?</p><p>As a first step to implementing geographically dispersed content, don&rsquo;t attempt to redesign your web application to work in a distributed architecture. Depending on the application, changing the architecture could include daunting tasks such as synchronizing session state and replicating database transactions across server locations. Attempts to reduce the distance between users and your content could be delayed by, or never pass, this application architecture step.</p><p>Remember that 80-90% of the end-user response time is spent downloading all the components in the page: images, stylesheets, scripts, Flash, etc. This is the <em>Performance Golden Rule</em>. Rather than starting with the difficult task of redesigning your application architecture, it&rsquo;s better to first disperse your static content. This not only achieves a bigger reduction in response times, but it&rsquo;s easier thanks to content delivery networks.</p><p>A content delivery network (CDN) is a collection of web servers distributed across multiple locations to deliver content more efficiently to users. The server selected for delivering content to a specific user is typically based on a measure of network proximity. For example, the server with the fewest network hops or the server with the quickest response time is chosen.</p><p>Some large Internet companies own their own CDN, but it&rsquo;s cost-effective to use a CDN service provider, such as <a href=\"http://www.akamai.com/\">Akamai Technologies</a>, <a href=\"http://www.edgecast.com/\">EdgeCast</a>, or <a href=\"http://www.level3.com/index.cfm?pageID=36\">level3</a>. For start-up companies and private web sites, the cost of a CDN service can be prohibitive, but as your target audience grows larger and becomes more global, a CDN is necessary to achieve fast response times. At Yahoo!, properties that moved static content off their application web servers to a CDN (both 3rd party as mentioned above as well as Yahoo’s own <a href=\"https://cwiki.apache.org/TS/traffic-server.html\">CDN</a>) improved end-user response times by 20% or more. Switching to a CDN is a relatively easy code change that will dramatically improve the speed of your web site.</p>", "id": "ycdn", "title": "ycdn"}