{"content": "<p>Dans nos recherches sur la performance chez Yahoo!, nous avons découvert que le déplacement des feuilles de style dans la partie HEAD du document rend les pages <em>apparemment</em> plus rapides à charger. C&rsquo;est parce que mettre des feuilles de style dans la partie HEAD d&rsquo;un document permet à la page d&rsquo;être rendue progressivement.</p><p>Les ingénieurs se souciant de performance veulent une page à chargement progressif, c&rsquo;est ce que nous voulons pour que le navigateur affiche n&rsquo;importe quel contenu le plus rapidement possible. Ceci est particulièrement important pour les pages avec beaucoup de contenu et pour les utilisateurs de connexions Internet lentes. L&rsquo;importance de donner aux utilisateurs un retour visuel, tels que des indicateurs de progrès a été bien <a href=\"http://www.useit.com/papers/responsetime.html\">documenté</a>. Dans notre cas, la page HTML est l&rsquo;indicateur de progression! Lorsque le navigateur charge la page progressivement, l&rsquo;en-tête, la barre de navigation, le logo en haut, etc. tous ces éléments servent de feedback visuel pour l&rsquo;utilisateur qui est en attente de la page. Cela améliore l&rsquo;expérience globale de l&rsquo;utilisateur.</p><p>Le problème en mettant les feuilles en bas de document est l&rsquo;interdiction du rendu progressif dans de nombreux navigateurs, y compris Internet Explorer. Ces navigateurs bloquent tout rendu pour éviter d&rsquo;avoir à redessiner des éléments de la page si leurs styles changent. L&rsquo;utilisateur est scotché une page blanche.</p><p>La <a href=\"http://www.w3.org/TR/html4/struct/links.html#h-12.3\">spécification HTML</a> stipule clairement que les feuilles de style doivent être incluses dans la partie HEAD de la page. &ldquo;Contrairement à la balise A, la balise [LINK] ne peut apparaître que dans la section HEAD d&rsquo;un document mais peut apparaître plusieurs fois.&rdquo; Aucune des alternatives comme les flashs de contenus non stylés ou le grand écran blanc ne valent de prendre le risque. La solution optimale est de suivre la spécification HTML et de charger vos feuilles de style dans la partie HEAD du document.</p>", "id": "ycsstop", "title": "Mettre les feuilles de style en début de page"}