{"content": "<p>Les redirections sont effectuées en utilisant les codes d&rsquo;état 301 et 302 . Voici un exemple d&rsquo;en-têtes HTTP contenus dans une réponse 301 :</p><pre><code>HTTP/1.1 301 Moved PermanentlyLocation: http://example.com/newuriContent-Type: text/html</code></pre><p>Le navigateur conduit automatiquement l&rsquo;utilisateur vers l&rsquo;URL spécifiée dans le champ <code>Location</code>. Toutes les informations nécessaires pour une redirection sont contenues dans les en-têtes. Le corps de la réponse est généralement vide. Malgré leur nom, aucune réponse 301 ou 302 n&rsquo;est mise en cache dans la pratique, sauf si des en-têtes supplémentaires, comme <code>Expire</code> ou <code>Cache-Control</code> indiquent qu&rsquo;elle devrait l&rsquo;être. La balise meta refresh et JavaScript sont d&rsquo;autres façons de diriger les utilisateurs vers une URL différente, mais si vous devez faire une redirection, la technique préférée est d&rsquo;utiliser les codes d&rsquo;état HTTP 3xx standards, principalement pour s&rsquo;assurer que le bouton de retour du navigateur fonctionne correctement.</p><p>La principale chose à retenir est que les redirections ralentissent l&rsquo;expérience utilisateur. L&rsquo;insertion d&rsquo;une redirection entre l&rsquo;utilisateur et le document HTML retarde tout le rendu de la page puisqu&rsquo;aucun composant ne peut commencer à être téléchargé jusqu&rsquo;à ce que le document HTML ne soit arrivé.</p><p>L&rsquo;une des redirections les plus inutiles est aussi l&rsquo;une des plus fréquentes (et les développeurs web ne sont généralement pas au courant). Elle se produit quand une barre oblique (/) est absente depuis une URL qui devrait en avoir une. Par exemple, aller à <a href=\"http://astrology.yahoo.com/astrology entraîne une réponse 301 contenant une redirection vers [http://astrology.yahoo.com / astrologie/](http://astrology.yahoo.com/astrology/\">http://astrology.yahoo.com/astrology</a> (notez le slash ajouté). Ce problème est résolu dans Apache en utilisant les directives <code>Alias</code>, <code>mod_rewrite</code> ou <code>DirectorySlash directive</code>.</p><p>La connexion d&rsquo;un ancien site Web vers un nouveau est un autre usage répandu pour les redirections. D&rsquo;autres usages consistent à relier les différentes parties d&rsquo;un site Web et de diriger l&rsquo;utilisateur en fonction de certaines conditions (type de navigateur, type de compte utilisateur, etc.). Utiliser une redirection pour connecter deux sites Web est simple et nécessite peu de code supplémentaire. Bien que l&rsquo;utilisation des redirections dans ces situations réduit la complexité pour les développeurs, elle dégrade l&rsquo;expérience utilisateur. Si la redirection a lieu sur le même serveur, il est possible d&rsquo;utiliser <code>Alias​​</code> et <code>mod_rewrite</code> comme alternatives pour cette utilisation de redirections. Si un changement de nom de domaine est la cause de l&rsquo;utilisation de redirections, une alternative est de créer un CNAME (un enregistrement DNS qui crée un pointage d&rsquo;alias de nom d&rsquo;un domaine à l&rsquo;autre) en combinaison avec <code>Alias</code> ou <code>mod_rewrite</code>.</p>", "id": "yredirects", "title": "Éviter les redirections"}